PerformanceTests/Negative (2).yml
execution:
- concurrency: 5
  hold-for: 1m
  ramp-up: 10s
  scenario: Negative (2)

scenarios:
  Negative (2):
    requests:
      - url: 'http://localhost:8080/index.php'
        method: GET
      - url: 'http://localhost:8080/shipping.php'
        method: POST
        think-time: 1000ms
        body:
          Dist: Amazon
          Price: '10.00'
          ProductName: Premium Laptop
          Size: Small
      - url: 'http://localhost:8080/delivery.php'
        method: POST
        think-time: 31935ms
        body:
          Adr1Correct: 'true'
          Adr1Empty: 'false'
          Adr1Valid: 'true'
          Adr2Correct: 'null'
          Adr2Empty: 'true'
          Adr2Valid: 'true'
          ConfirmEmail: '1234.com'
          CountryEmpty: 'false'
          CountryValid: 'true'
          CountyCorrect: 'null'
          CountyEmpty: 'null'
          CountyValid: 'true'
          EarlyFinish: 'false'
          Email: '1234.com'
          EmailEmpty: 'null'
          EmailValid: 'true'
          EmailsDontMatch: 'null'
          NameCorrect: 'null'
          NameEmpty: 'null'
          NameValid: 'true'
          PostCodeCorrect: 'null'
          PostCodeEmpty: 'null'
          PostCodeValid: 'true'
          country: 'England'
          county: '<<<EMPTY>>>'
          line1: '!2341234%$'
          line2: '<<<EMPTY>>>'
          name: 'name'
          post_code: OX294TP